{"introduction": 21012, "to": 39431, "python": 31878, "programming": 31557, "senior": 34279, "contributing": 11254, "authors": 6927, "udayan": 40795, "das": 12018, "saint": 33746, "mary": 24174, "college": 10247, "of": 26957, "california": 8678, "aubrey": 6905, "lawson": 22690, "wiley": 42977, "chris": 9687, "mayfield": 24361, "james": 22077, "madison": 23978, "university": 40952, "narges": 25887, "norouzi": 26230, "uc": 40793, "berkeley": 7722, "openstax": 28097, "rice": 33396, "main": 23990, "ms": 25376, "375": 2261, "learn": 22717, "more": 25238, "about": 3439, "visit": 42274, "https": 18938, "org": 28655, "individual": 20110, "print": 30804, "copies": 11398, "and": 4637, "bulk": 8300, "orders": 28641, "can": 8899, "be": 7281, "purchased": 31795, "through": 39248, "our": 29052, "website": 42494, "2024": 1478, "textbook": 37381, "content": 11138, "produced": 31310, "by": 8380, "is": 21101, "licensed": 22978, "under": 40818, "creative": 11798, "commons": 10563, "attribution": 6894, "international": 20913, "license": 22970, "cc": 9179, "introduction to": 21044, "to python": 39752, "python programming": 31981, "senior contributing": 34280, "contributing authors": 11255, "udayan das": 40796, "das saint": 12021, "saint mary": 33747, "mary college": 24175, "college of": 10254, "of california": 27025, "aubrey lawson": 6906, "lawson wiley": 22693, "chris mayfield": 9689, "mayfield james": 24363, "james madison": 22079, "madison university": 23979, "narges norouzi": 25888, "norouzi uc": 26232, "uc berkeley": 40794, "rice university": 33397, "to learn": 39671, "more about": 25239, "about openstax": 3455, "https openstax": 18943, "openstax org": 28109, "individual print": 20119, "print copies": 30840, "copies and": 11399, "and bulk": 4724, "bulk orders": 8301, "orders can": 28643, "can be": 8907, "be purchased": 7414, "purchased through": 31796, "through our": 39260, "our website": 29061, "website 2024": 42495, "2024 rice": 1480, "university textbook": 40970, "textbook content": 37383, "content produced": 11160, "produced by": 31313, "by openstax": 8467, "openstax is": 28105, "is licensed": 21372, "licensed under": 22981, "under creative": 40822, "creative commons": 11800, "commons attribution": 10564, "attribution international": 6901, "international license": 20917, "license cc": 22973, "cc by": 9180, "this": 39097, "any": 5676, "user": 41277, "or": 28371, "contents": 11166, "herein": 18616, "must": 25495, "provide": 31721, "proper": 31699, "as": 6361, "follows": 16643, "if": 19064, "you": 43831, "redistribute": 32612, "in": 19435, "digital": 13158, "format": 16996, "including": 19857, "but": 8326, "not": 26236, "limited": 23070, "pdf": 29868, "html": 18925, "then": 38801, "retain": 33159, "on": 27736, "every": 14773, "page": 29436, "following": 16553, "access": 3561, "for": 16682, "free": 17256, "at": 6733, "include": 19781, "physical": 30049, "part": 29725, "view": 42253, "printed": 31093, "use": 41115, "bibliographic": 7809, "reference": 32634, "please": 30212, "details": 12803, "books": 8032, "your": 43883, "citation": 9726, "by under": 8508, "under this": 40826, "this license": 39129, "license any": 22972, "any user": 5707, "user of": 41305, "of this": 27332, "this textbook": 39153, "textbook or": 37388, "or the": 28488, "the textbook": 38433, "textbook contents": 37384, "contents herein": 11174, "herein must": 18617, "must provide": 25509, "provide proper": 31732, "proper attribution": 31700, "attribution as": 6896, "as follows": 6401, "follows if": 16648, "if you": 19166, "you redistribute": 43863, "redistribute this": 32614, "textbook in": 37387, "in digital": 19530, "digital format": 13159, "format including": 17020, "including but": 19863, "but not": 8344, "not limited": 26313, "limited to": 23072, "to pdf": 39735, "pdf and": 29869, "and html": 4915, "html then": 18933, "then you": 38848, "you must": 43856, "must retain": 25510, "retain on": 33161, "on every": 27768, "every page": 14779, "page the": 29442, "the following": 37928, "following attribution": 16559, "attribution access": 6895, "access for": 3584, "for free": 16780, "free at": 17258, "at openstax": 6763, "org if": 28808, "in print": 19642, "print format": 30878, "format then": 17046, "must include": 25504, "include on": 19810, "every physical": 14780, "physical page": 30050, "redistribute part": 32613, "part of": 29734, "textbook then": 37389, "retain in": 33160, "in every": 19542, "every digital": 14775, "format page": 17031, "page view": 29444, "view including": 42255, "html and": 18926, "and on": 5033, "physical printed": 30051, "printed page": 31116, "you use": 43877, "use this": 41186, "textbook as": 37382, "as bibliographic": 6373, "bibliographic reference": 7810, "reference please": 32661, "please include": 30215, "include https": 19801, "org details": 28759, "details books": 12806, "books introduction": 8036, "introduction python": 21039, "programming in": 31571, "in your": 19736, "your citation": 43889, "questions": 32082, "regarding": 32693, "licensing": 22983, "contact": 11077, "support": 36718, "citation for": 9727, "for questions": 16869, "questions regarding": 32096, "regarding this": 32694, "this licensing": 39130, "licensing please": 22984, "please contact": 30213, "contact support": 11078, "support openstax": 36724, "book": 7998, "utilizes": 41578, "code": 10013, "runner": 33671, "org this": 28866, "this book": 39104, "book utilizes": 8023, "utilizes the": 41579, "the openstax": 38192, "openstax python": 28112, "python code": 31904, "code runner": 10141, "developed": 12836, "all": 4181, "rights": 33424, "reserved": 33010, "runner the": 33675, "the code": 37762, "runner is": 33673, "is developed": 21259, "developed by": 12838, "by wiley": 8514, "wiley and": 42978, "and is": 4943, "is all": 21167, "all rights": 4229, "rights reserved": 33426, "trademarks": 40188, "name": 25635, "logo": 23678, "covers": 11635, "cnx": 10005, "tutor": 40452, "connexions": 10990, "are": 5901, "subject": 36437, "may": 24337, "reproduced": 32959, "without": 43340, "prior": 31214, "express": 15454, "written": 43664, "consent": 10995, "reserved trademarks": 33011, "trademarks the": 40189, "openstax name": 28107, "name openstax": 25723, "openstax logo": 28106, "logo openstax": 23681, "openstax book": 28099, "book covers": 8005, "covers openstax": 11636, "openstax cnx": 28101, "cnx name": 10007, "cnx logo": 10006, "openstax tutor": 28115, "tutor name": 40456, "tutor logo": 40455, "logo connexions": 23680, "connexions name": 10992, "name connexions": 25668, "connexions logo": 10991, "logo rice": 23682, "university name": 40967, "name and": 25648, "and rice": 5156, "university logo": 40965, "logo are": 23679, "are not": 6015, "not subject": 26348, "subject to": 36439, "to the": 39834, "the license": 38074, "license and": 22971, "and may": 4993, "may not": 24350, "not be": 26255, "be reproduced": 7425, "reproduced without": 32960, "without the": 43362, "the prior": 38261, "prior and": 31215, "and express": 4857, "express written": 15455, "written consent": 43670, "consent of": 10996, "of rice": 27267, "version": 42213, "isbn": 21708, "13": 768, "978": 3172, "961584": 3165, "45": 2486, "original": 28913, "publication": 31786, "year": 43758, "10": 121, "cjp": 9744, "24": 1628, "provides": 31755, "peer": 29884, "reviewed": 33363, "openly": 28092, "textbooks": 37390, "introductory": 21045, "advanced": 3921, "placement": 30152, "courses": 11622, "low": 23893, "cost": 11501, "personalized": 29986, "courseware": 11628, "that": 37469, "helps": 18577, "students": 36351, "university digital": 40960, "digital version": 13161, "version isbn": 42217, "isbn 13": 21709, "13 978": 789, "978 961584": 3173, "961584 45": 3166, "45 original": 2494, "original publication": 28919, "publication year": 31787, "year 2024": 43761, "2024 10": 1479, "10 cjp": 170, "cjp 24": 9745, "24 openstax": 1638, "openstax openstax": 28108, "openstax provides": 28111, "provides free": 31758, "free peer": 17262, "peer reviewed": 29885, "reviewed openly": 33364, "openly licensed": 28093, "licensed textbooks": 22980, "textbooks for": 37391, "for introductory": 16809, "introductory college": 21046, "college and": 10248, "and advanced": 4668, "advanced placement": 3923, "placement courses": 30153, "courses and": 11623, "and low": 4980, "low cost": 23894, "cost personalized": 11503, "personalized courseware": 29987, "courseware that": 11629, "that helps": 37542, "helps students": 18582, "students learn": 36359, "nonprofit": 26217, "ed": 13869, "tech": 37151, "initiative": 20318, "based": 7179, "we": 42460, "re": 32296, "committed": 10531, "helping": 18575, "tools": 40022, "they": 39062, "need": 25943, "complete": 10658, "their": 38737, "meet": 24427, "educational": 13910, "goals": 18092, "learn nonprofit": 22722, "nonprofit ed": 26219, "ed tech": 13870, "tech initiative": 37153, "initiative based": 20319, "based at": 7182, "at rice": 6767, "university we": 40971, "we re": 42468, "re committed": 32298, "committed to": 10532, "to helping": 39636, "helping students": 18576, "students access": 36352, "access the": 3595, "the tools": 38443, "tools they": 40030, "they need": 39069, "need to": 25952, "to complete": 39536, "complete their": 10667, "their courses": 38740, "and meet": 4995, "meet their": 24429, "their educational": 38743, "educational goals": 13913, "an": 4457, "goals rice": 18093, "university openstax": 40969, "is an": 21172, "an initiative": 4528, "initiative of": 20322, "leading": 22705, "research": 33000, "with": 43062, "distinctive": 13300, "commitment": 10529, "undergraduate": 40829, "education": 13898, "aspires": 6574, "path": 29811, "breaking": 8214, "unsurpassed": 40998, "teaching": 37128, "contributions": 11256, "betterment": 7763, "world": 43518, "university as": 40955, "as leading": 6418, "leading research": 22706, "research university": 33007, "university with": 40974, "with distinctive": 43115, "distinctive commitment": 13301, "commitment to": 10530, "to undergraduate": 39863, "undergraduate education": 40831, "education rice": 13908, "university aspires": 40956, "aspires to": 6575, "to path": 39734, "path breaking": 29814, "breaking research": 8216, "research unsurpassed": 33008, "unsurpassed teaching": 40999, "teaching and": 37129, "and contributions": 4776, "contributions to": 11258, "the betterment": 37709, "betterment of": 7764, "of our": 27226, "our world": 29062, "it": 21801, "seeks": 34168, "fulfill": 17460, "mission": 24893, "cultivating": 11871, "diverse": 13312, "community": 10568, "learning": 22731, "discovery": 13231, "produces": 31316, "leaders": 22703, "across": 3725, "spectrum": 35437, "human": 18951, "endeavor": 14314, "world it": 43532, "it seeks": 21898, "seeks to": 34169, "to fulfill": 39621, "fulfill this": 17461, "this mission": 39133, "mission by": 24894, "by cultivating": 8420, "cultivating diverse": 11872, "diverse community": 13314, "community of": 10579, "of learning": 27156, "learning and": 22732, "and discovery": 4811, "discovery that": 13232, "that produces": 37587, "produces leaders": 31321, "leaders across": 22704, "across the": 3729, "the spectrum": 38378, "spectrum of": 35439, "of human": 27132, "human endeavor": 18952, "philanthropic": 30012, "grateful": 18171, "generous": 17896, "partners": 29747, "who": 42908, "advance": 3919, "improve": 19416, "everyone": 14792, "endeavor philanthropic": 14315, "philanthropic support": 30015, "is grateful": 21314, "grateful for": 18172, "for the": 16905, "the generous": 37964, "generous philanthropic": 17897, "philanthropic partners": 30014, "partners who": 29751, "who advance": 42909, "advance our": 3920, "our mission": 29056, "mission to": 24895, "to improve": 39643, "improve educational": 19418, "educational access": 13911, "access and": 3569, "and learning": 4960, "learning for": 22737, "for everyone": 16764, "see": 34159, "impact": 19270, "supporter": 36730, "most": 25286, "updated": 41054, "list": 23281, "foundation": 17196, "everyone to": 14798, "to see": 39785, "see the": 34163, "the impact": 38003, "impact of": 19271, "our supporter": 29059, "supporter community": 36731, "community and": 10569, "and our": 5048, "our most": 29057, "most updated": 25314, "updated list": 41056, "list of": 23375, "of partners": 27232, "partners please": 29750, "please visit": 30219, "visit openstax": 42275, "org foundation": 28793, "arnold": 6250, "ventures": 42198, "chan": 9250, "zuckerberg": 43964, "chegg": 9634, "inc": 19768, "foundation arnold": 17197, "arnold ventures": 6251, "ventures chan": 42199, "chan zuckerberg": 9251, "zuckerberg initiative": 43965, "initiative chegg": 20320, "chegg inc": 9635, "arthur": 6350, "carlyse": 9064, "ciocca": 9701, "charitable": 9483, "promise": 31666, "ann": 5597, "john": 22145, "doerr": 13477, "bill": 7817, "melinda": 24437, "gates": 17833, "girard": 17950, "google": 18122, "william": 43030, "flora": 16485, "hewlett": 18624, "packard": 29430, "company": 10593, "intel": 20856, "inc arthur": 19769, "arthur and": 6351, "and carlyse": 4733, "carlyse ciocca": 9065, "ciocca charitable": 9702, "charitable foundation": 9485, "foundation digital": 17201, "digital promise": 13160, "promise ann": 31667, "ann and": 5598, "and john": 4951, "john doerr": 22146, "doerr bill": 13478, "bill melinda": 7826, "melinda gates": 24438, "gates foundation": 17834, "foundation girard": 17202, "girard foundation": 17951, "foundation google": 17203, "google inc": 18132, "inc the": 19771, "the william": 38519, "william and": 43031, "and flora": 4875, "flora hewlett": 16486, "hewlett foundation": 18625, "foundation the": 17211, "the hewlett": 37985, "hewlett packard": 18626, "packard company": 29431, "company intel": 10596, "intel inc": 20857, "rusty": 33714, "jaggers": 22075, "calvin": 8892, "kazanjian": 22242, "economics": 13864, "charles": 9486, "koch": 22474, "leon": 22845, "lowenstein": 23900, "inc rusty": 19770, "rusty and": 33715, "john jaggers": 22147, "jaggers the": 22076, "the calvin": 37738, "calvin kazanjian": 8893, "kazanjian economics": 22243, "economics foundation": 13866, "foundation charles": 17199, "charles koch": 9487, "koch foundation": 22475, "foundation leon": 17207, "leon lowenstein": 22846, "lowenstein foundation": 23901, "foundation inc": 17206, "maxfield": 24325, "burt": 8316, "deedee": 12340, "mcmurtry": 24367, "michelson": 24721, "20mm": 1499, "national": 25891, "science": 33901, "open": 28046, "society": 35052, "foundations": 17213, "jumee": 22199, "yhu": 43811, "david": 12211, "park": 29707, "iii": 19220, "brian": 8229, "the maxfield": 38114, "maxfield foundation": 24326, "foundation burt": 17198, "burt and": 8317, "and deedee": 4799, "deedee mcmurtry": 12341, "mcmurtry michelson": 24368, "michelson 20mm": 24722, "20mm foundation": 1500, "foundation national": 17208, "national science": 25893, "science foundation": 33919, "the open": 38190, "open society": 28071, "society foundations": 35054, "foundations jumee": 17214, "jumee yhu": 22200, "yhu and": 43812, "and david": 4795, "david park": 12213, "park iii": 29710, "iii brian": 19221, "patterson": 29843, "usa": 41100, "stephanie": 35864, "sick": 34649, "fund": 17752, "steven": 35883, "smith": 34970, "diana": 12923, "brian patterson": 8230, "patterson usa": 29844, "usa international": 41101, "international foundation": 20916, "the bill": 37712, "bill and": 7822, "and stephanie": 5202, "stephanie sick": 35865, "sick fund": 34650, "fund steven": 17753, "steven smith": 35884, "smith diana": 34971, "go": 18074, "stand": 35593, "together": 39950, "robin": 33469, "sandy": 33839, "stuart": 36323, "family": 15735, "tammy": 37053, "guillermo": 18277, "trevi\u00f1o": 40255, "valhalla": 41599, "white": 42902, "star": 35615, "schmidt": 33895, "futures": 17785, "marsh": 24172, "preface": 30700, "statements": 35748, "71": 2916, "1background": 1287, "2input": 1925, "output": 29131, "3variables": 2410, "14": 852, "4string": 2598, "basics": 7203, "16": 1041, "5number": 2790, "20": 1359, "6error": 2895, "messages": 24518, "7comments": 2997, "27": 1774, "8why": 3097, "diana go": 12924, "go stand": 18082, "stand together": 35594, "together robin": 39957, "robin and": 33470, "and sandy": 5167, "sandy stuart": 33842, "stuart foundation": 36325, "the stuart": 38402, "stuart family": 36324, "family foundation": 15736, "foundation tammy": 17210, "tammy and": 37054, "and guillermo": 4899, "guillermo trevi\u00f1o": 18278, "trevi\u00f1o valhalla": 40256, "valhalla charitable": 41600, "foundation white": 17212, "white star": 42904, "star education": 35616, "education foundation": 13901, "foundation schmidt": 17209, "schmidt futures": 33896, "futures william": 17786, "william marsh": 43032, "marsh rice": 24173, "university contents": 40959, "contents preface": 11181, "preface statements": 30705, "statements 71": 35752, "71 introduction": 2921, "introduction 1background": 21017, "1background 2input": 1288, "2input output": 1926, "output 10": 29132, "10 3variables": 141, "3variables 14": 2411, "14 4string": 864, "4string basics": 2599, "basics 16": 7208, "16 5number": 1051, "5number basics": 2791, "basics 20": 7214, "20 6error": 1367, "6error messages": 2896, "messages 24": 24519, "24 7comments": 1631, "7comments 27": 2998, "27 8why": 1776, "8why python": 3098, "31": 2037, "9chapter": 3231, "summary": 36578, "34": 2144, "expressions": 15513, "392": 2310, "39": 2300, "1the": 1348, "shell": 34498, "40": 2415, "2type": 1962, "conversion": 11291, "42": 2448, "3mixed": 2371, "data": 12024, "types": 40731, "4floating": 2564, "point": 30296, "errors": 14623, "48": 2518, "5dividing": 2771, "integers": 20802, "51": 2662, "6the": 2908, "math": 24216, "module": 25045, "54": 2702, "7formatting": 3007, "60": 2807, "8python": 3092, "careers": 9043, "65": 2847, "67": 2867, "objects": 26838, "713": 2923, "1strings": 1346, "revisited": 33372, "2formatted": 1917, "strings": 36219, "76": 2964, "79": 2986, "4list": 2582, "83": 3040, "5tuple": 2802, "85": 3051, "6chapter": 2892, "88": 3072, "decisions": 12303, "914": 3117, "91": 3110, "1boolean": 1290, "values": 41848, "2if": 1919, "else": 14101, "96": 3160, "3boolean": 2331, "operations": 28169, "100": 241, "4operator": 2588, "precedence": 30658, "104": 472, "5chained": 2761, "107": 483, "6nested": 2899, "113": 575, "7conditional": 3003, "116": 589, "8chapter": 3082, "118": 596, "loops": 23857, "1215": 705, "121": 701, "1while": 1357, "loop": 23740, "2for": 1915, "125": 737, "3nested": 2375, "129": 756, "4break": 2544, "continue": 11191, "133": 829, "5loop": 2784, "137": 838, "140": 902, "functions": 17684, "1456": 939, "145": 935, "1defining": 1304, "2control": 1884, "flow": 16493, "149": 949, "3variable": 2408, "scope": 33971, "153": 1017, "4parameters": 2594, "158": 1030, "5return": 2794, "163": 1088, "6keyword": 2897, "arguments": 6197, "168": 1101, "7chapter": 2995, "170": 1127, "modules": 25134, "1737": 1137, "173": 1135, "1module": 1328, "174": 1139, "2importing": 1923, "names": 25837, "177": 1146, "3top": 2404, "level": 22884, "180": 1182, "4the": 2603, "help": 18554, "function": 17481, "184": 1194, "5finding": 2777, "189": 1205, "194": 1233, "1978": 1247, "197": 1241, "1string": 1344, "2string": 1953, "slicing": 34903, "200": 1403, "3searching": 2396, "testing": 37348, "204": 1483, "formatting": 17090, "209": 1494, "5splitting": 2798, "joining": 22167, "217": 1534, "220": 1558, "lists": 23471, "2239": 1569, "223": 1566, "1modifying": 1326, "iterating": 22021, "2sorting": 1951, "reversing": 33356, "226": 1575, "3common": 2336, "229": 1584, "4nested": 2586, "231": 1607, "5list": 2782, "comprehensions": 10743, "234": 1614, "238": 1623, "dictionaries": 12958, "24110": 1647, "241": 1645, "1dictionary": 1306, "2dictionary": 1896, "creation": 11778, "243": 1653, "3dictionary": 2342, "245": 1659, "4conditionals": 2549, "looping": 23847, "250": 1697, "5nested": 2788, "dictionary": 12987, "comprehension": 10709, "256": 1725, "260": 1747, "classes": 9868, "26511": 1760, "265": 1758, "11": 509, "1object": 1330, "oriented": 28908, "2classes": 1878, "instances": 20614, "267": 1764, "3instance": 2353, "methods": 24642, "272": 1786, "4overloading": 2592, "operators": 28279, "276": 1794, "5using": 2804, "281": 1816, "283": 1822, "recursion": 32526, "28712": 1834, "287": 1832, "12": 610, "1recursion": 1336, "2simple": 1949, "289": 1838, "3recursion": 2390, "292": 1850, "4more": 2584, "294": 1854, "solve": 35120, "problems": 31250, "297": 1858, "301": 2014, "inheritance": 20217, "30313": 2021, "303": 2019, "1inheritance": 1313, "2attribute": 1873, "306": 2027, "3methods": 2367, "310": 2041, "4hierarchical": 2568, "316": 2054, "5multiple": 2786, "mixin": 24927, "320": 2078, "323": 2085, "files": 16126, "32714": 2096, "327": 2094, "1reading": 1334, "from": 17298, "2writing": 1966, "331": 2112, "3files": 2351, "different": 13095, "locations": 23629, "working": 43496, "csv": 11829, "335": 2131, "4handling": 2566, "exceptions": 15135, "339": 2141, "5raising": 2792, "344": 2164, "347": 2175, "34915": 2182, "349": 2180, "15": 952, "1introduction": 1315, "2numpy": 1937, "352": 2198, "3pandas": 2379, "354": 2202, "4exploratory": 2558, "analysis": 4585, "362": 2227, "5data": 2767, "visualization": 42285, "368": 2243, "6summary": 2905, "answer": 5655, "key": 22266, "379": 2270, "index": 19972, "403": 2437, "which": 42750, "501": 2652, "corporation": 11424, "python 31": 31883, "31 9chapter": 2038, "9chapter summary": 3232, "summary 34": 36601, "34 expressions": 2148, "expressions 392": 15516, "392 introduction": 2312, "introduction 39": 21025, "39 1the": 2301, "1the python": 1349, "python shell": 31993, "shell 40": 34501, "40 2type": 2417, "2type conversion": 1963, "conversion 42": 11293, "42 3mixed": 2450, "3mixed data": 2372, "data types": 12117, "types 45": 40734, "45 4floating": 2489, "4floating point": 2565, "point errors": 30308, "errors 48": 14624, "48 5dividing": 2520, "5dividing integers": 2772, "integers 51": 20807, "51 6the": 2665, "6the math": 2909, "math module": 24236, "module 54": 25046, "54 7formatting": 2704, "7formatting code": 3008, "code 60": 10024, "60 8python": 2811, "8python careers": 3093, "careers 65": 9044, "65 9chapter": 2851, "summary 67": 36607, "67 objects": 2870, "objects 713": 26840, "713 introduction": 2924, "introduction 71": 21026, "71 1strings": 2917, "1strings revisited": 1347, "revisited 71": 33375, "71 2formatted": 2918, "2formatted strings": 1918, "strings 76": 36229, "76 3variables": 2965, "3variables revisited": 2413, "revisited 79": 33378, "79 4list": 2987, "4list basics": 2583, "basics 83": 7229, "83 5tuple": 3041, "5tuple basics": 2803, "basics 85": 7230, "85 6chapter": 3053, "6chapter summary": 2894, "summary 88": 36609, "88 decisions": 3074, "decisions 914": 12311, "914 introduction": 3118, "introduction 91": 21027, "91 1boolean": 3111, "1boolean values": 1291, "values 91": 41859, "91 2if": 3112, "2if else": 1920, "else statements": 14147, "statements 96": 35753, "96 3boolean": 3161, "3boolean operations": 2332, "operations 100": 28171, "100 4operator": 251, "4operator precedence": 2589, "precedence 104": 30659, "104 5chained": 474, "5chained decisions": 2762, "decisions 107": 12304, "107 6nested": 485, "6nested decisions": 2900, "decisions 113": 12307, "113 7conditional": 578, "7conditional expressions": 3004, "expressions 116": 15514, "116 8chapter": 591, "8chapter summary": 3083, "summary 118": 36580, "118 loops": 600, "loops 1215": 23858, "1215 introduction": 706, "introduction 121": 21013, "121 1while": 703, "1while loop": 1358, "loop 121": 23741, "121 2for": 704, "2for loop": 1916, "loop 125": 23744, "125 3nested": 740, "3nested loops": 2376, "loops 129": 23859, "129 4break": 757, "4break and": 2545, "and continue": 4774, "continue 133": 11192, "133 5loop": 830, "5loop else": 2785, "else 137": 14104, "137 6chapter": 839, "summary 140": 36582, "140 functions": 903, "functions 1456": 17686, "1456 introduction": 940, "introduction 145": 21014, "145 1defining": 937, "1defining functions": 1305, "functions 145": 17685, "145 2control": 938, "2control flow": 1885, "flow 149": 16494, "149 3variable": 950, "3variable scope": 2409, "scope 153": 33972, "153 4parameters": 1018, "4parameters 158": 2595, "158 5return": 1031, "5return values": 2795, "values 163": 41850, "163 6keyword": 1089, "6keyword arguments": 2898, "arguments 168": 6198, "168 7chapter": 1102, "7chapter summary": 2996, "summary 170": 36585, "170 modules": 1129, "modules 1737": 25135, "1737 introduction": 1138, "introduction 173": 21015, "173 1module": 1136, "1module basics": 1329, "basics 174": 7210, "174 2importing": 1140, "2importing names": 1924, "names 177": 25838, "177 3top": 1147, "3top level": 2405, "level code": 22889, "code 180": 10014, "180 4the": 1185, "4the help": 2604, "help function": 18559, "function 184": 17483, "184 5finding": 1195, "5finding modules": 2778, "modules 189": 25136, "189 6chapter": 1206, "summary 194": 36587, "194 strings": 1235, "strings 1978": 36220, "1978 introduction": 1248, "introduction 197": 21016, "197 1string": 1242, "1string operations": 1345, "operations 197": 28174, "197 2string": 1243, "2string slicing": 1955, "slicing 200": 34904, "200 3searching": 1404, "3searching testing": 2397, "testing strings": 37350, "strings 204": 36221, "204 4string": 1484, "4string formatting": 2600, "formatting 209": 17091, "209 access": 1495, "org 5splitting": 28731, "5splitting joining": 2799, "joining strings": 22172, "strings 217": 36224, "217 6chapter": 1535, "summary 220": 36589, "220 lists": 1559, "lists 2239": 23474, "2239 introduction": 1570, "introduction 223": 21018, "223 1modifying": 1567, "1modifying and": 1327, "and iterating": 4947, "iterating lists": 22023, "lists 223": 23473, "223 2sorting": 1568, "2sorting and": 1952, "and reversing": 5153, "reversing lists": 33358, "lists 226": 23476, "226 3common": 1576, "3common list": 2337, "list operations": 23378, "operations 229": 28176, "229 4nested": 1585, "4nested lists": 2587, "lists 231": 23478, "231 5list": 1608, "5list comprehensions": 2783, "comprehensions 234": 10744, "234 6chapter": 1615, "summary 238": 36591, "238 dictionaries": 1624, "dictionaries 24110": 12960, "24110 introduction": 1648, "introduction 241": 21019, "241 10": 1646, "10 1dictionary": 132, "1dictionary basics": 1307, "basics 241": 7218, "10 2dictionary": 138, "2dictionary creation": 1897, "creation 243": 11781, "243 10": 1654, "10 3dictionary": 140, "3dictionary operations": 2343, "operations 245": 28177, "245 10": 1660, "10 4conditionals": 145, "4conditionals and": 2550, "and looping": 4979, "looping in": 23848, "in dictionaries": 19527, "dictionaries 250": 12961, "250 10": 1698, "10 5nested": 149, "5nested dictionaries": 2789, "dictionaries and": 12967, "and dictionary": 4809, "dictionary comprehension": 13002, "comprehension 256": 10712, "256 10": 1726, "10 6chapter": 151, "summary 260": 36593, "260 classes": 1749, "classes 26511": 9871, "26511 introduction": 1761, "introduction 265": 21020, "265 11": 1759, "11 1object": 516, "1object oriented": 1331, "oriented programming": 28911, "programming basics": 31563, "basics 265": 7219, "11 2classes": 517, "2classes and": 1879, "and instances": 4938, "instances 267": 20616, "267 11": 1765, "11 3instance": 518, "3instance methods": 2354, "methods 272": 24645, "272 11": 1787, "11 4overloading": 521, "4overloading operators": 2593, "operators 276": 28281, "276 11": 1795, "11 5using": 523, "5using modules": 2805, "modules with": 25178, "with classes": 43097, "classes 281": 9872, "281 11": 1817, "11 6chapter": 524, "summary 283": 36596, "283 recursion": 1824, "recursion 28712": 32528, "28712 introduction": 1835, "introduction 287": 21021, "287 12": 1833, "12 1recursion": 621, "1recursion basics": 1337, "basics 287": 7220, "12 2simple": 625, "2simple math": 1950, "math recursion": 24242, "recursion 289": 32529, "289 12": 1839, "12 3recursion": 628, "3recursion with": 2391, "with strings": 43213, "strings and": 36233, "and lists": 4972, "lists 292": 23480, "292 12": 1851, "12 4more": 629, "4more math": 2585, "recursion 294": 32531, "294 12": 1855, "12 5using": 633, "5using recursion": 2806, "recursion to": 32560, "to solve": 39804, "solve problems": 35124, "problems 297": 31252, "297 12": 1859, "12 6chapter": 634, "summary 301": 36598, "301 inheritance": 2016, "inheritance 30313": 20219, "30313 introduction": 2022, "introduction 303": 21022, "303 13": 2020, "13 1inheritance": 777, "1inheritance basics": 1314, "basics 303": 7222, "13 2attribute": 782, "2attribute access": 1874, "access 306": 3563, "306 13": 2028, "13 3methods": 784, "3methods 310": 2369, "310 13": 2042, "13 4hierarchical": 786, "4hierarchical inheritance": 2569, "inheritance 316": 20220, "316 13": 2055, "13 5multiple": 787, "5multiple inheritance": 2787, "inheritance and": 20224, "and mixin": 5002, "mixin classes": 24929, "classes 320": 9873, "320 13": 2079, "13 6chapter": 788, "summary 323": 36599, "323 files": 2086, "files 32714": 16129, "32714 introduction": 2097, "introduction 327": 21023, "327 14": 2095, "14 1reading": 859, "1reading from": 1335, "from files": 17328, "files 327": 16128, "14 2writing": 861, "2writing to": 1967, "to files": 39609, "files 331": 16132, "331 14": 2113, "14 3files": 862, "3files in": 2352, "in different": 19529, "different locations": 13122, "locations and": 23630, "and working": 5299, "working with": 43503, "with csv": 43107, "csv files": 11837, "files 335": 16134, "335 14": 2132, "14 4handling": 863, "4handling exceptions": 2567, "exceptions 339": 15137, "339 14": 2142, "14 5raising": 866, "5raising exceptions": 2793, "exceptions 344": 15140, "344 14": 2165, "14 6chapter": 868, "summary 347": 36602, "347 data": 2176, "data science": 12096, "science 34915": 33904, "34915 introduction": 2183, "introduction 349": 21024, "349 15": 2181, "15 1introduction": 960, "1introduction to": 1316, "to data": 39549, "science 349": 33903, "15 2numpy": 963, "2numpy 352": 1939, "352 15": 2199, "15 3pandas": 965, "3pandas 354": 2381, "354 15": 2203, "15 4exploratory": 966, "4exploratory data": 2559, "data analysis": 12032, "analysis 362": 4587, "362 15": 2228, "15 5data": 967, "5data visualization": 2768, "visualization 368": 42287, "368 15": 2244, "15 6summary": 968, "6summary 375": 2906, "375 answer": 2262, "answer key": 5661, "key 379": 22267, "379 index": 2272, "index 403": 19974, "403 access": 2438, "org preface": 28835, "preface about": 30701, "is part": 21439, "university which": 40973, "which is": 42802, "is 501": 21144, "501 nonprofit": 2653, "nonprofit charitable": 26218, "charitable corporation": 9484, "corporation as": 11425, "as an": 6367, "an educational": 4486, "educational initiative": 13914, "initiative it": 20321, "it our": 21879, "partnerships": 29753, "organizations": 28894, "alliance": 4248, "other": 28944, "resource": 33020, "companies": 10590, "down": 13613, "common": 10533, "barriers": 7154, "everyone through": 14797, "our partnerships": 29058, "partnerships with": 29754, "with philanthropic": 43189, "philanthropic organizations": 30013, "organizations and": 28895, "our alliance": 29053, "alliance with": 4249, "with other": 43184, "other educational": 28960, "educational resource": 13915, "resource companies": 33021, "companies we": 10592, "re breaking": 32297, "breaking down": 8215, "down the": 13620, "the most": 38146, "most common": 25293, "common barriers": 10535, "barriers to": 7155, "to learning": 39672, "because": 7497, "believe": 7656, "should": 34565, "have": 18418, "knowledge": 22460, "learning because": 22734, "because we": 7516, "we believe": 42462, "believe that": 7657, "that everyone": 37527, "everyone should": 14794, "should and": 34568, "and can": 4729, "can have": 8930, "have access": 18419, "access to": 3597, "to knowledge": 39667, "resources": 33024, "customization": 11932, "programmingis": 31597, "means": 24396, "distribute": 13304, "remix": 32773, "build": 8269, "upon": 41076, "long": 23696, "its": 22057, "contributors": 11259, "knowledge about": 22461, "openstax resources": 28113, "resources customization": 33025, "customization introduction": 11933, "python programmingis": 31982, "programmingis licensed": 31600, "international cc": 20914, "by license": 8453, "license which": 22976, "which means": 42815, "means that": 24402, "that you": 37634, "you can": 43837, "can distribute": 8918, "distribute remix": 13305, "remix and": 32774, "and build": 4723, "build upon": 8275, "upon the": 41077, "the content": 37795, "content as": 11141, "as long": 6422, "long as": 23699, "as you": 6501, "you provide": 43861, "provide attribution": 31725, "attribution to": 6902, "to openstax": 39722, "openstax and": 28098, "and its": 4948, "its content": 22058, "content contributors": 11146, "entire": 14434, "select": 34181, "only": 27961, "sections": 34154, "relevant": 32746, "needs": 25965, "course": 11606, "contributors because": 11260, "because our": 7511, "our books": 29054, "books are": 8033, "are openly": 6024, "licensed you": 22982, "you are": 43835, "are free": 5965, "free to": 17264, "to use": 39869, "use the": 41171, "the entire": 37872, "entire book": 14436, "book or": 8016, "or select": 28475, "select only": 34183, "only the": 28001, "the sections": 38345, "sections that": 34158, "that are": 37484, "are most": 6010, "most relevant": 25307, "relevant to": 32748, "the needs": 38160, "needs of": 25968, "of your": 27380, "your course": 43893, "feel": 15812, "assigning": 6622, "certain": 9231, "chapters": 9359, "syllabus": 36784, "order": 28546, "prefer": 30706, "course feel": 11611, "feel free": 15814, "to remix": 39764, "remix the": 32775, "content by": 11144, "by assigning": 8396, "assigning your": 6630, "your students": 43912, "students certain": 36356, "certain chapters": 9232, "chapters and": 9360, "and sections": 5174, "sections in": 34156, "your syllabus": 43913, "syllabus in": 36785, "in the": 19693, "the order": 38201, "order that": 28599, "you prefer": 43860, "even": 14744, "direct": 13194, "link": 23271, "web": 42478, "prefer you": 30707, "can even": 8924, "even provide": 14756, "provide direct": 31728, "direct link": 13197, "link in": 23272, "syllabus to": 36787, "the web": 38510, "web view": 42488, "view of": 42258, "your book": 43887, "instructors": 20662, "also": 4328, "option": 28343, "creating": 11754, "customized": 11937, "book instructors": 8012, "instructors also": 20663, "also have": 4341, "have the": 18465, "the option": 38199, "option of": 28349, "of creating": 27066, "creating customized": 11759, "customized version": 11938, "version of": 42218, "of their": 27322, "their openstax": 38748, "instructor": 20659, "section": 34141, "information": 20160, "book visit": 8024, "visit the": 42278, "the instructor": 38031, "instructor resources": 20660, "resources section": 33028, "section of": 34148, "book page": 8017, "page on": 29440, "on openstax": 27795, "org for": 28791, "for more": 16841, "more information": 25262, "art": 6343, "inintroduction": 20273, "photos": 30030, "third": 39084, "party": 29764, "illustrations": 19234, "contain": 11079, "creator": 11801, "holder": 18765, "host": 18808, "platform": 30190, "within": 43297, "caption": 9002, "information art": 20165, "art attribution": 6345, "attribution inintroduction": 6900, "inintroduction to": 20274, "programming most": 31579, "most photos": 25301, "photos and": 30031, "and third": 5246, "third party": 39093, "party illustrations": 29766, "illustrations contain": 19235, "contain attribution": 11081, "to their": 39840, "their creator": 38741, "creator rights": 11804, "rights holder": 33425, "holder host": 18766, "host platform": 18809, "platform and": 30191, "and or": 5043, "or license": 28442, "license within": 22977, "within the": 43317, "the caption": 37740, "anyone": 5709, "reuse": 33337, "same": 33782, "source": 35252, "caption because": 9003, "because the": 7513, "the art": 37687, "art is": 6348, "is openly": 21431, "licensed anyone": 22979, "anyone may": 5712, "may reuse": 24356, "reuse the": 33340, "art as": 6344, "as they": 6481, "they provide": 39070, "provide the": 31733, "the same": 38330, "same attribution": 33785, "to its": 39661, "its original": 22061, "original source": 28921, "maximize": 24327, "readability": 32356, "some": 35144, "does": 13479, "text": 37355, "source to": 35262, "to maximize": 39692, "maximize readability": 24328, "readability and": 32357, "and content": 4773, "content flow": 11149, "flow some": 16509, "some art": 35148, "art does": 6347, "does not": 13488, "not include": 26301, "include attribution": 19787, "attribution in": 6899, "the text": 38432, "public": 31782, "domain": 13562, "cc0": 9181, "similar": 34692, "reused": 33341, "text this": 37378, "this art": 39101, "of the": 27312, "the public": 38273, "public domain": 31784, "domain or": 13565, "or under": 28500, "under cc0": 40821, "cc0 or": 9182, "or similar": 28479, "similar license": 34693, "be reused": 7428, "reused without": 33343, "without attribution": 43343, "attribution for": 6898, "for illustrations": 16794, "graphs": 18169, "charts": 9504, "etc": 14679, "credited": 11805, "copyright": 11415, "illustrations graphs": 19236, "graphs charts": 18170, "charts etc": 9506, "etc that": 14681, "not credited": 26266, "credited use": 11806, "attribution copyright": 6897, "copyright rice": 11416, "openstax under": 28116, "under cc": 40820, "errata": 14539, "undergo": 40827, "rigorous": 33427, "review": 33359, "process": 31273, "license errata": 22974, "errata all": 14540, "all openstax": 4218, "openstax textbooks": 28114, "textbooks undergo": 37392, "undergo rigorous": 40828, "rigorous review": 33428, "review process": 33362, "however": 18903, "like": 23000, "professional": 31353, "grade": 18143, "sometimes": 35167, "occur": 26905, "process however": 31280, "however like": 18908, "like any": 23005, "any professional": 5702, "professional grade": 31355, "grade textbook": 18146, "textbook errors": 37385, "errors sometimes": 14651, "sometimes occur": 35170, "since": 34744, "make": 24015, "updates": 41065, "periodically": 29962, "when": 42599, "deemed": 12342, "pedagogically": 29880, "necessary": 25934, "occur since": 26911, "since our": 34765, "are web": 6077, "web based": 42479, "based we": 7189, "we can": 42463, "can make": 8937, "make updates": 24042, "updates periodically": 41068, "periodically when": 29963, "when deemed": 42620, "deemed pedagogically": 12343, "pedagogically necessary": 29881, "correction": 11456, "suggest": 36544, "submit": 36444, "matter": 24289, "experts": 15365, "suggestions": 36547, "necessary if": 25939, "you have": 43849, "have correction": 18428, "correction to": 11457, "to suggest": 39821, "suggest submit": 36546, "submit it": 36445, "it through": 21918, "through the": 39264, "the link": 38086, "link on": 23273, "on your": 27828, "org subject": 28855, "subject matter": 36438, "matter experts": 24291, "experts review": 15367, "review all": 33360, "all errata": 4197, "errata suggestions": 14542, "remaining": 32763, "transparent": 40212, "so": 34982, "will": 42984, "find": 16225, "past": 29802, "pending": 29886, "changes": 9291, "suggestions openstax": 36548, "is committed": 21228, "to remaining": 39762, "remaining transparent": 32766, "transparent about": 40213, "about all": 3444, "all updates": 4239, "updates so": 41069, "so you": 35031, "you will": 43881, "will also": 42986, "also find": 4338, "find list": 16233, "of past": 27234, "past and": 29803, "and pending": 5061, "pending errata": 29887, "errata changes": 14541, "changes on": 9304, "org format": 28792, "format you": 17051, "can access": 8900, "access this": 3596, "textbook for": 37386, "free in": 17259, "in web": 19722, "view or": 42259, "or pdf": 28465, "pdf through": 29873, "through openstax": 39259, "recommended": 32491, "accessible": 3625, "being": 7630, "cag": 8580, "aa": 3389, "compliant": 10693, "current": 11909, "org the": 28862, "view is": 42256, "is the": 21555, "the recommended": 38292, "recommended format": 32494, "format because": 17009, "because it": 7504, "it is": 21861, "most accessible": 25287, "accessible including": 3626, "including being": 19860, "being cag": 7633, "cag aa": 8581, "aa compliant": 3392, "compliant and": 10694, "and most": 5009, "most current": 25295, "aboutintroduction": 3464, "programmingprovides": 31601, "comprehensive": 10756, "concepts": 10854, "skills": 34874, "aligned": 4151, "current aboutintroduction": 11910, "aboutintroduction to": 3465, "programming introduction": 31572, "python programmingprovides": 31983, "programmingprovides comprehensive": 31602, "comprehensive foundation": 10757, "foundation in": 17205, "in programming": 19645, "programming concepts": 31567, "concepts and": 10855, "and skills": 5187, "skills and": 34875, "is aligned": 21166, "aligned to": 4158, "the scope": 38335, "scope of": 33985, "of most": 27192, "most introductory": 25297, "introductory courses": 21047, "wide": 42938, "array": 6280, "scenarios": 33889, "contexts": 11187, "reflect": 32685, "applications": 5799, "many": 24088, "disciplines": 13216, "courses wide": 11627, "wide array": 42940, "array of": 6296, "of scenarios": 27274, "scenarios contexts": 33890, "contexts and": 11188, "and problems": 5097, "problems reflect": 31258, "reflect programming": 32687, "programming applications": 31562, "applications in": 5800, "in many": 19593, "many disciplines": 24101, "disciplines and": 13217, "and careers": 4732, "offering": 27466, "suitable": 36551, "learner": 22729, "audience": 6907, "those": 39175, "pursuing": 31814, "computer": 10779, "business": 8318, "social": 35047, "statistics": 35832, "related": 32711, "areas": 6120, "study": 36367, "employment": 14228, "careers the": 9052, "the offering": 38185, "offering is": 27468, "is suitable": 21543, "suitable for": 36552, "for diverse": 16746, "diverse learner": 13315, "learner audience": 22730, "audience including": 6908, "including those": 19878, "those pursuing": 39178, "pursuing computer": 31815, "computer science": 10794, "science business": 33911, "business science": 8322, "science social": 33937, "social science": 35050, "science statistics": 33938, "statistics data": 35833, "science and": 33908, "and related": 5130, "related areas": 32712, "areas of": 6121, "of study": 27300, "study and": 36368, "and employment": 4832, "interactive": 20875, "teaches": 37126, "basic": 7190, "problem": 31224, "solving": 35134, "language": 22526, "using": 41398, "hands": 18319, "activities": 3741, "employment preface": 14229, "preface introduction": 30704, "programmingis an": 31598, "an interactive": 4537, "interactive offering": 20879, "offering that": 27469, "that teaches": 37618, "teaches basic": 37127, "basic programming": 7200, "concepts problem": 10862, "problem solving": 31240, "solving skills": 35137, "and the": 5231, "the python": 38276, "python language": 31954, "language using": 22562, "using hands": 41446, "hands on": 18320, "on activities": 27738, "includes": 19839, "unique": 40903, "integrated": 20839, "immediately": 19251, "apply": 5822, "what": 42542, "check": 9509, "understanding": 40856, "activities the": 3743, "the resource": 38308, "resource includes": 33022, "includes unique": 19854, "unique integrated": 40911, "integrated code": 20840, "runner through": 33676, "through which": 39265, "which students": 42844, "students can": 36355, "can immediately": 8933, "immediately apply": 19253, "apply what": 5828, "what they": 42581, "they learn": 39066, "learn to": 22725, "to check": 39524, "check their": 9518, "their understanding": 38754, "embedded": 14182, "videos": 42248, "critical": 11809, "thinking": 39082, "exercises": 15279, "explorations": 15420, "external": 15560, "contribute": 11250, "meaningful": 24392, "supportive": 36734, "experience": 15350, "understanding embedded": 40858, "embedded videos": 14184, "videos critical": 42251, "critical thinking": 11811, "thinking exercises": 39083, "exercises and": 15280, "and explorations": 4855, "explorations of": 15421, "of external": 27103, "external programming": 15562, "programming tools": 31596, "tools and": 40023, "and activities": 4664, "activities all": 3742, "all contribute": 4191, "contribute to": 11251, "to meaningful": 39694, "meaningful and": 24393, "and supportive": 5218, "supportive learning": 36736, "learning experience": 22735, "organized": 28900, "each": 13727, "chapter": 9319, "containing": 11109, "experience the": 15352, "content is": 11152, "is organized": 21434, "organized in": 28902, "in chapters": 19497, "chapters with": 9363, "with each": 43118, "each chapter": 13734, "chapter containing": 9340, "containing sections": 11115, "pattern": 29833, "objectives": 26829, "subsections": 36449, "practice": 30528, "designed": 12760, "readers": 32367, "identify": 19024, "focus": 16520, "sections each": 34155, "each section": 13794, "section follows": 34146, "follows the": 16653, "the pattern": 38226, "pattern learning": 29836, "learning objectives": 22741, "objectives subsections": 26833, "subsections programming": 36450, "programming practice": 31585, "practice the": 30635, "the learning": 38067, "objectives are": 26831, "are designed": 5940, "designed to": 12763, "to help": 39635, "help readers": 18567, "readers identify": 32370, "identify the": 19041, "the section": 38344, "section focus": 34145, "objective": 26827, "completes": 10679, "sentence": 34287, "end": 14278, "able": 3437, "focus each": 16522, "each objective": 13779, "objective completes": 26828, "completes the": 10680, "the sentence": 38349, "sentence by": 34289, "by the": 8499, "the end": 37869, "end of": 14295, "this section": 39145, "section you": 34153, "you should": 43868, "should be": 34570, "be able": 7285, "able to": 3438, "aligns": 4169, "gives": 18053, "opportunity": 28335, "learned": 22726, "the programming": 38268, "practice aligns": 30531, "aligns with": 4170, "with the": 43218, "objectives and": 26830, "and gives": 4894, "gives readers": 18056, "readers an": 32368, "an opportunity": 4558, "opportunity to": 28337, "to apply": 39485, "apply concepts": 5823, "concepts learned": 10860, "learned in": 22727, "pedagogical": 29878, "concise": 10876, "video": 42245, "animations": 5578, "foster": 17165, "active": 3738, "student": 36326, "engagement": 14334, "section pedagogical": 34149, "pedagogical foundation": 29879, "foundation concise": 17200, "concise text": 10881, "text and": 37357, "and video": 5287, "video based": 42246, "based animations": 7181, "animations introduction": 5580, "programmingis designed": 31599, "to foster": 39620, "foster active": 17166, "active learning": 3740, "and student": 5210, "student engagement": 36330, "focuses": 16527, "interactivity": 20891, "links": 23274, "environments": 14475, "engagement it": 14336, "it focuses": 21845, "focuses on": 16528, "on interactivity": 27780, "interactivity and": 20892, "and practice": 5077, "practice through": 30638, "through its": 39256, "its integrated": 22060, "runner videos": 33677, "videos and": 42249, "and links": 4970, "links to": 23277, "to external": 39599, "external environments": 15561, "environments and": 14476, "material": 24209, "often": 27651, "less": 22847, "activity": 3745, "activities with": 3744, "with that": 43217, "that focus": 37532, "focus the": 16524, "the material": 38108, "material is": 24210, "is often": 21426, "often more": 27664, "more concise": 25250, "concise with": 10884, "with less": 43160, "less text": 22850, "and more": 5008, "more activity": 25240, "activity each": 3746, "section content": 34143, "in subsections": 19686, "subsection": 36446, "begins": 7609, "concept": 10846, "term": 37277, "definitions": 12566, "brief": 8231, "context": 11184, "relevance": 32744, "importance": 19351, "subsections the": 36451, "the subsection": 38407, "subsection begins": 36447, "begins with": 7614, "with concise": 43103, "concise introduction": 10879, "the concept": 37789, "concept with": 10853, "with key": 43152, "key term": 22314, "term definitions": 37278, "definitions and": 12567, "and brief": 4721, "brief context": 8232, "context for": 11186, "for its": 16814, "its relevance": 22062, "relevance and": 32745, "and importance": 4922, "explained": 15383, "detail": 12799, "importance the": 19353, "concept is": 10851, "is then": 21557, "then explained": 38822, "explained in": 15384, "in detail": 19526, "detail using": 12802, "using video": 41524, "animations and": 5579, "and interactive": 4941, "interactive learning": 20878, "learning questions": 22746, "animation": 5568, "step": 35846, "approach": 5839, "show": 34605, "execution": 15241, "questions animation": 32085, "animation videos": 5576, "videos use": 42252, "use step": 41167, "step by": 35850, "by step": 8494, "step approach": 35849, "approach to": 5843, "to show": 39795, "show the": 34613, "the execution": 37888, "execution of": 15252, "of python": 27253, "explanations": 15397, "describe": 12680, "syntax": 36798, "how": 18865, "fundamental": 17754, "used": 41192, "illustrate": 19228, "variables": 42119, "assigned": 6601, "emphasize": 14196, "executes": 15213, "line": 23090, "create": 11648, "programs": 31603, "code explanations": 10072, "explanations for": 15399, "for each": 16751, "each step": 13799, "step describe": 35852, "describe python": 12688, "python syntax": 32005, "syntax show": 36811, "show how": 34608, "how fundamental": 18879, "fundamental programming": 17758, "concepts are": 10856, "are used": 6072, "used illustrate": 41210, "illustrate how": 19229, "how variables": 18898, "variables are": 42125, "are assigned": 5916, "assigned emphasize": 6604, "emphasize how": 14197, "how code": 18870, "code executes": 10070, "executes line": 15227, "line by": 23119, "by line": 8454, "line apply": 23110, "apply problem": 5826, "solving to": 35141, "to create": 39546, "create programs": 11678, "programs and": 31609, "checkpoint": 9537, "displaying": 13272, "multimedia": 25406, "www": 43693, "after": 3972, "introducing": 21009, "new": 26031, "explaining": 15385, "form": 16990, "more checkpoint": 25244, "checkpoint displaying": 9560, "displaying output": 13274, "output to": 29224, "the 